Revit 2026 API

# View3DHideGridsOnLevel Method

---

This method hides the grid lines in this 3D view on the given Level.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void HideGridsOnLevel(
	ElementId levelId
)
```
```vb
Public Sub HideGridsOnLevel (
	levelId As ElementId
)
```
```cpp
public:
void HideGridsOnLevel(
	ElementId^ levelId
)
```
```fsharp
member HideGridsOnLevel :
        levelId : ElementId -> unit
```

#### Parameters

levelId ElementId
     The id of the Level where grids will not be displayed.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

#### Reference

View3D Class

Autodesk.Revit.DB Namespace